<h1>Pandas</h1>

In [1]:
import pandas as pd
import numpy as np

<h2>5.1 Data structures</h2>

<h3>Series</h3>

In [2]:
obj=pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

shows col1=index, col2=values, data type

In [3]:
obj.values

array([1, 2, 3, 4])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=pd.Series([2,4,6,8],index=['d','c','a','b'])
obj2

d    2
c    4
a    6
b    8
dtype: int64

In [6]:
obj2.index

Index(['d', 'c', 'a', 'b'], dtype='object')

In [7]:
obj2['a']

6

In [8]:
obj2[['b','d']]

b    8
d    2
dtype: int64

In [9]:
obj2[obj2>5]

a    6
b    8
dtype: int64

In [10]:
obj2*2

d     4
c     8
a    12
b    16
dtype: int64

similar to ordered dicts

In [11]:
'b' in obj2

True

In [12]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [13]:
obj3=pd.Series(sdata)

In [14]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [16]:
obj4=pd.Series(sdata,index=states)

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [21]:
obj4.name='population'
obj4.index.name='state'

In [22]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

<h3>Dataframe</h3>

In [23]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)

In [24]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [26]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four',
'five', 'six'])

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2['debt']=10

In [34]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    10
two    2001    Ohio  1.7    10
three  2002    Ohio  3.6    10
four   2001  Nevada  2.4    10
five   2002  Nevada  2.9    10
six    2003  Nevada  3.2    10

In [35]:
frame2['debt']=np.arange(6.)

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [37]:
val=pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [38]:
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [40]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [41]:
# if dict of dicts
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [42]:
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [43]:
#transpose
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [44]:
frame3.index.name='year'
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

<h3>Index objects</h3>

In [45]:
# is an object Series_like itself, inmutable
obj=pd.Series(range(3), index=['a','b','c'])
index=obj.index

In [46]:
index

Index(['a', 'b', 'c'], dtype='object')

In [47]:
index[1:]

Index(['b', 'c'], dtype='object')

In [48]:
index[1]='d'

TypeError: Index does not support mutable operations

In [ ]:
labels=pd.Index(np.arange(3))
labels

In [ ]:
obj2=pd.Series([1.4,-9.4,0],index=labels)
obj2

In [ ]:
obj2.index is labels

Index behave like python sets but allows repeated elemens. Functions: append, difference, intersection, union...

<h2>5.2 Essentials</h2>

<h3>Reindexing</h3>

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

In [ ]:
obj3.reindex(range(6),method='ffill')

In [ ]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

In [ ]:
frame2=frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

<h3>Drop entries from axis</h3>

In [ ]:
obj=pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

In [ ]:
new_obj=obj.drop('c')
new_obj

In [ ]:
# inplace modifies data definetly and DESTROYS dropped values
obj.drop('c',inplace=True)
obj

In [ ]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two',axis=1)

<H3>Indexing, selection and filtering</h3>

In [ ]:
obj = pd.Series(np.arange(4.),index=['a', 'b', 'c', 'd'])

In [ ]:
obj

In [ ]:
obj['b']

In [ ]:
obj[1]

In [ ]:
obj[2:]

In [ ]:
obj[[1,3]]

In [ ]:
obj[obj<2]

In [ ]:
# slicing with labels INCLUDES the end point
obj['b':'c']

In [ ]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data['two']

In [ ]:
data[['three','one']]

In [ ]:
# EXCEPTION:passing a range (:2) refers to rows, passing single elements or lists refers to columns
data[:2]

In [ ]:
data<5

In [ ]:
data[data<5]=0

In [ ]:
data

In [ ]:
# LOC and ILOC for slicing index labels (loc) or integers (iloc)
data.loc['Colorado', ['two', 'three']]

In [ ]:
data.iloc[2,[3,0,1]]

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[1:3]

In [ ]:
data.loc[:'Utah','two']

In [ ]:
data.iloc[:,:3]

In [ ]:
data.iloc[:,:3][data.three>5]

<h3>Integer indexes</h3>

In [ ]:
#if no labels are assigned as indexes, [-1] selection wont work
ser=pd.Series(np.arange(3.))
ser

In [ ]:
#ser[-1] #throws an error

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

In [ ]:
ser[:1]

In [ ]:
ser.loc[:1]

In [ ]:
ser.iloc[:1]

<h3>Arithmetic and data alignment</h3>

In [49]:
s1=pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [50]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [51]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

if indexes dont overlap, missing values propagate

In [52]:
df1=pd.DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df2=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [53]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [54]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

c & e are not found in <b>both</b> dfs

<h3>Arithmetics methods with fill values</h3>

In [55]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))

In [56]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [57]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [59]:
df2.loc[1,'b']=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [61]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

see table 5.5 for other methods

<h3>Operations between S and DF</h3>

In [65]:
#numpy example
arr=np.arange(12.).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [66]:
arr[0]

array([0., 1., 2., 3.])

In [67]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [69]:
#pandas
frame=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series=frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [70]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [72]:
#works if indexes match
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [74]:
series2=pd.Series(range(3),index=list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [77]:
#indexes dont match, perfoms a union
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [79]:
#column serires
series3=frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [82]:
#Substract series3 to every frame column
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

<h3>Function aplication and mapping</h3>

In [83]:
#numpy ufuncs work with pandas objects
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -2.157340 -0.795322 -1.206685
Ohio   -0.975712 -1.068264 -0.321192
Texas   0.709483 -0.025589  1.472238
Oregon  0.673833  0.118013 -0.586856

In [84]:
np.abs(frame)

               b         d         e
Utah    2.157340  0.795322  1.206685
Ohio    0.975712  1.068264  0.321192
Texas   0.709483  0.025589  1.472238
Oregon  0.673833  0.118013  0.586856

In [85]:
f=lambda x:x.max()-x.min()
frame.apply(f)

b    2.866823
d    1.186278
e    2.678923
dtype: float64

In [86]:
frame.apply(f,axis='columns')

Utah      1.362018
Ohio      0.747072
Texas     1.497827
Oregon    1.260689
dtype: float64

In [87]:
frame.sum()

b   -1.749737
d   -1.771162
e   -0.642495
dtype: float64

In [88]:
frame.sum(axis='columns')

Utah     -4.159347
Ohio     -2.365169
Texas     2.156132
Oregon    0.204990
dtype: float64

In [90]:
#function for 'apply' can return anything
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [91]:
frame.apply(f)

            b         d         e
min -2.157340 -1.068264 -1.206685
max  0.709483  0.118013  1.472238

In [92]:
frame.apply(f,axis='columns')

             min       max
Utah   -2.157340 -0.795322
Ohio   -1.068264 -0.321192
Texas  -0.025589  1.472238
Oregon -0.586856  0.673833

In [93]:
#element-wise with applymap
formats=lambda x:'%.2f' % x
frame.applymap(formats)

            b      d      e
Utah    -2.16  -0.80  -1.21
Ohio    -0.98  -1.07  -0.32
Texas    0.71  -0.03   1.47
Oregon   0.67   0.12  -0.59

In [94]:
frame['e'].map(formats)

Utah      -1.21
Ohio      -0.32
Texas      1.47
Oregon    -0.59
Name: e, dtype: object

<h3>Sorting and ranking</h3>

In [95]:
obj=pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [96]:
#sort index lexicographically
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [97]:
frame=pd.DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [98]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [99]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [100]:
frame.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [101]:
#sort by values
obj=pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [103]:
obj.sort_values()
#if there are NaNs, they are sorted at the end

2   -3
3    2
0    4
1    7
dtype: int64